---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropUIService
source: html/05be9167-98d5-42f9-9118-d2361292f410.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropUIService Property

The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI.
 To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropUIServer .

## Syntax (C#)
```csharp
public static ExternalServiceId PipeFittingAndAccessoryPressureDropUIService { get; }
```